# Pandas Deep dive

In [1]:
import pandas as pd
import numpy as np

In [3]:
#Un dataframe se puede construir con iterables, diccionarios, dataframes...
a = np.random.random((10,4))
a

array([[0.87619969, 0.39750682, 0.86839001, 0.75203107],
       [0.61199437, 0.77650103, 0.91152747, 0.86754079],
       [0.35715679, 0.62571887, 0.22077119, 0.34722249],
       [0.04156595, 0.82053126, 0.16912459, 0.33441127],
       [0.96147871, 0.80522737, 0.21599506, 0.13054606],
       [0.57172319, 0.64789825, 0.64395942, 0.30210125],
       [0.63463621, 0.21765347, 0.30903749, 0.12761888],
       [0.00742707, 0.19115056, 0.03486133, 0.30982385],
       [0.53756037, 0.10918312, 0.26307686, 0.43865678],
       [0.62852564, 0.43466898, 0.1512762 , 0.337192  ]])

In [4]:
a.shape

(10, 4)

In [5]:
df = pd.DataFrame(a)

In [7]:
df.columns

RangeIndex(start=0, stop=4, step=1)

In [8]:
df = pd.DataFrame(a, columns = ['uno','dos','tres','cuatro']) #Asignando columnas a un nuevo dataframe

In [9]:
df

        uno       dos      tres    cuatro
0  0.876200  0.397507  0.868390  0.752031
1  0.611994  0.776501  0.911527  0.867541
2  0.357157  0.625719  0.220771  0.347222
3  0.041566  0.820531  0.169125  0.334411
4  0.961479  0.805227  0.215995  0.130546
5  0.571723  0.647898  0.643959  0.302101
6  0.634636  0.217653  0.309037  0.127619
7  0.007427  0.191151  0.034861  0.309824
8  0.537560  0.109183  0.263077  0.438657
9  0.628526  0.434669  0.151276  0.337192

In [16]:
df[['uno','dos']].max() #Podemos indexar columnas, y con doble corchete podemos indexar varias columnas

uno    0.961479
dos    0.820531
dtype: float64

In [15]:
df.uno.dos.max()

AttributeError: 'Series' object has no attribute 'dos'

In [17]:
df['cinco'] = df['uno']/df['dos']

In [18]:
df

        uno       dos      tres    cuatro     cinco
0  0.876200  0.397507  0.868390  0.752031  2.204238
1  0.611994  0.776501  0.911527  0.867541  0.788144
2  0.357157  0.625719  0.220771  0.347222  0.570794
3  0.041566  0.820531  0.169125  0.334411  0.050657
4  0.961479  0.805227  0.215995  0.130546  1.194046
5  0.571723  0.647898  0.643959  0.302101  0.882427
6  0.634636  0.217653  0.309037  0.127619  2.915810
7  0.007427  0.191151  0.034861  0.309824  0.038855
8  0.537560  0.109183  0.263077  0.438657  4.923475
9  0.628526  0.434669  0.151276  0.337192  1.445987

In [20]:
df[['dos','tres']][5:]

        dos      tres
5  0.647898  0.643959
6  0.217653  0.309037
7  0.191151  0.034861
8  0.109183  0.263077
9  0.434669  0.151276

In [22]:
df.loc[5:,['dos','tres']] #localizacion de elementos con 'loc' es con etiquetas

        dos      tres
5  0.647898  0.643959
6  0.217653  0.309037
7  0.191151  0.034861
8  0.109183  0.263077
9  0.434669  0.151276

In [24]:
df.iloc[5:,[1,2]] #localizacion de elementos con 'iloc' es con numeros

        dos      tres
5  0.647898  0.643959
6  0.217653  0.309037
7  0.191151  0.034861
8  0.109183  0.263077
9  0.434669  0.151276

In [29]:
df[['uno','dos']][df['cinco'] < 0.5] #Se pueden filtrar filas con indexacion

        uno       dos
3  0.041566  0.820531
7  0.007427  0.191151

In [32]:
df[['uno','dos']][(df['cinco'] > 0.5) & (df['cinco'] < 1.5)] # se pueden usar varias condicionales para filtar filas

        uno       dos
1  0.611994  0.776501
2  0.357157  0.625719
4  0.961479  0.805227
5  0.571723  0.647898
9  0.628526  0.434669

In [36]:
df.index = ['a','b','c','d','e','f','g','h','i','j']

In [47]:
lst = ['a','b','c','d','e','f','g','h','i','j']

In [44]:
df.reset_index(drop = True, inplace = True)

In [50]:
df

        uno       dos      tres    cuatro     cinco
0  0.876200  0.397507  0.868390  0.752031  2.204238
1  0.611994  0.776501  0.911527  0.867541  0.788144
2  0.357157  0.625719  0.220771  0.347222  0.570794
3  0.041566  0.820531  0.169125  0.334411  0.050657
4  0.961479  0.805227  0.215995  0.130546  1.194046
5  0.571723  0.647898  0.643959  0.302101  0.882427
6  0.634636  0.217653  0.309037  0.127619  2.915810
7  0.007427  0.191151  0.034861  0.309824  0.038855
8  0.537560  0.109183  0.263077  0.438657  4.923475
9  0.628526  0.434669  0.151276  0.337192  1.445987

In [53]:
df.reindex(lst, fill_value= df.values)

   uno  dos  tres  cuatro  cinco
a  NaN  NaN   NaN     NaN    NaN
b  NaN  NaN   NaN     NaN    NaN
c  NaN  NaN   NaN     NaN    NaN
d  NaN  NaN   NaN     NaN    NaN
e  NaN  NaN   NaN     NaN    NaN
f  NaN  NaN   NaN     NaN    NaN
g  NaN  NaN   NaN     NaN    NaN
h  NaN  NaN   NaN     NaN    NaN
i  NaN  NaN   NaN     NaN    NaN
j  NaN  NaN   NaN     NaN    NaN

In [49]:
df

        uno       dos      tres    cuatro     cinco
0  0.876200  0.397507  0.868390  0.752031  2.204238
1  0.611994  0.776501  0.911527  0.867541  0.788144
2  0.357157  0.625719  0.220771  0.347222  0.570794
3  0.041566  0.820531  0.169125  0.334411  0.050657
4  0.961479  0.805227  0.215995  0.130546  1.194046
5  0.571723  0.647898  0.643959  0.302101  0.882427
6  0.634636  0.217653  0.309037  0.127619  2.915810
7  0.007427  0.191151  0.034861  0.309824  0.038855
8  0.537560  0.109183  0.263077  0.438657  4.923475
9  0.628526  0.434669  0.151276  0.337192  1.445987

In [54]:
hoteles=pd.DataFrame({'nombre':['Palace', 'Ritz', 0], 
                      'stars':[5,4,2], 'Precio':[800, 500, 100]})

In [55]:
hoteles

   nombre  stars  Precio
0  Palace      5     800
1    Ritz      4     500
2       0      2     100

In [56]:
hoteles.shape

(3, 3)

In [68]:
df[df > 0.5].fillna('no hay data') #filtro mas llenado de Nan

           uno          dos         tres       cuatro        cinco
0       0.8762  no hay data      0.86839     0.752031      2.20424
1     0.611994     0.776501     0.911527     0.867541     0.788144
2  no hay data     0.625719  no hay data  no hay data     0.570794
3  no hay data     0.820531  no hay data  no hay data  no hay data
4     0.961479     0.805227  no hay data  no hay data      1.19405
5     0.571723     0.647898     0.643959  no hay data     0.882427
6     0.634636  no hay data  no hay data  no hay data      2.91581
7  no hay data  no hay data  no hay data  no hay data  no hay data
8      0.53756  no hay data  no hay data  no hay data      4.92347
9     0.628526  no hay data  no hay data  no hay data      1.44599

In [71]:
hoteles['ratio'] = hoteles.stars/hoteles.Precio

In [81]:
hoteles.T

              0      1     2
nombre   Palace   Ritz     0
stars         5      4     2
Precio      800    500   100
ratio   0.00625  0.008  0.02

In [78]:
hoteles.transpose()

              0      1     2
nombre   Palace   Ritz     0
stars         5      4     2
Precio      800    500   100
ratio   0.00625  0.008  0.02

In [83]:
hoteles.sum()

stars       11.00000
Precio    1400.00000
ratio        0.03425
dtype: float64

In [84]:
hoteles.mean()

stars       3.666667
Precio    466.666667
ratio       0.011417
dtype: float64

In [85]:
hoteles.max()

stars       5.00
Precio    800.00
ratio       0.02
dtype: float64

In [86]:
hoteles.min()

stars       2.00000
Precio    100.00000
ratio       0.00625
dtype: float64

In [87]:
hoteles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
nombre    3 non-null object
stars     3 non-null int64
Precio    3 non-null int64
ratio     3 non-null float64
dtypes: float64(1), int64(2), object(1)
memory usage: 224.0+ bytes

In [88]:
hoteles.describe()

          stars      Precio     ratio
count  3.000000    3.000000  3.000000
mean   3.666667  466.666667  0.011417
std    1.527525  351.188458  0.007485
min    2.000000  100.000000  0.006250
25%    3.000000  300.000000  0.007125
50%    4.000000  500.000000  0.008000
75%    4.500000  650.000000  0.014000
max    5.000000  800.000000  0.020000

In [93]:
pd.read_csv('data/alumnos.csv', sep='-')

  Nombre  Edad  Apellido
0   Pepe    10     Perez
1   Juan    20       NaN
2   Luis    25  Martinez
3   Fran  15xº   Aguilar

In [94]:
import re

In [95]:
n = 'DF1930-GDL1915'

In [96]:
re.findall('\d+',n)

['1930', '1915']

In [98]:
m = n.split('-')

In [104]:
j = [re.findall('\w+',i) for i in m]

In [105]:
m

['DF1930', 'GDL1915']

In [106]:
j

[['DF1930'], ['GDL1915']]

In [111]:
d  =pd.read_json('data/alumnos_j.json')

In [116]:
d['aficiones'][0][0]['name']

'Beisbol'

In [137]:
hoteles.to_csv('data/hoteles.csv', index = False)

In [138]:
hoteles_2 = pd.read_csv('data/hoteles.csv')
hoteles_2

   nombre  stars  Precio    ratio
0  Palace      5     800  0.00625
1    Ritz      4     500  0.00800
2       0      2     100  0.02000

In [132]:
import pickle

In [131]:
lst = [1,2,3,4,4,5,6,7,7,8,8]

In [134]:
with open('data/lst', 'wb') as f: #open nos ayuda a escribir y leer archivos ('CUALQUIER ARCHIVO') de manera binaria
    pickle.dump(lst,f)

In [140]:
lst_new = pickle.load(open('data/lst','rb'))
lst_new

[1, 2, 3, 4, 4, 5, 6, 7, 7, 8, 8]

In [141]:
lst_new_2 = pickle.load(open('data/lst.p','rb'))
lst_new_2

[1, 2, 3, 4, 4, 5, 6, 7, 7, 8, 8]

In [142]:
import warnings
warnings.simplefilter('ignore')

In [143]:
df=pd.read_csv('data/vehicles_messy.csv')  # cargar csv en dataframe

df.head()

,barrels08,barrelsA08,charge120,charge240,city08,city08U,cityA08,cityA08U,cityCD,cityE,...,mfrCode,c240Dscr,charge240b,c240bDscr,createdOn,modifiedOn,startStop,phevCity,phevHwy,phevComb
0,15.695714,0.0,0.0,0.0,19,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
1,29.964545,0.0,0.0,0.0,9,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
2,12.207778,0.0,0.0,0.0,23,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
3,29.964545,0.0,0.0,0.0,10,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
4,17.347895,0.0,0.0,0.0,17,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0

In [144]:
df.shape

(37843, 83)

In [145]:
df.columns

Index(['barrels08', 'barrelsA08', 'charge120', 'charge240', 'city08',
       'city08U', 'cityA08', 'cityA08U', 'cityCD', 'cityE', 'cityUF', 'co2',
       'co2A', 'co2TailpipeAGpm', 'co2TailpipeGpm', 'comb08', 'comb08U',
       'combA08', 'combA08U', 'combE', 'combinedCD', 'combinedUF', 'cylinders',
       'displ', 'drive', 'engId', 'eng_dscr', 'feScore', 'fuelCost08',
       'fuelCostA08', 'fuelType', 'fuelType1', 'ghgScore', 'ghgScoreA',
       'highway08', 'highway08U', 'highwayA08', 'highwayA08U', 'highwayCD',
       'highwayE', 'highwayUF', 'hlv', 'hpv', 'id', 'lv2', 'lv4', 'make',
       'model', 'mpgData', 'phevBlended', 'pv2', 'pv4', 'range', 'rangeCity',
       'rangeCityA', 'rangeHwy', 'rangeHwyA', 'trany', 'UCity', 'UCityA',
       'UHighway', 'UHighwayA', 'VClass', 'year', 'youSaveSpend', 'guzzler',
       'trans_dscr', 'tCharger', 'sCharger', 'atvType', 'fuelType2', 'rangeA',
       'evMotor', 'mfrCode', 'c240Dscr', 'charge240b', 'c240bDscr',
       'createdOn', 'modifiedOn', 'startStop', 'phevCity', 'phevHwy',
       'phevComb'],
      dtype='object')

In [152]:
lst_make = df['make'].value_counts() #cuenta Valores unicos de make 
lst_make

Chevrolet                        3795
Ford                             3102
Dodge                            2513
GMC                              2389
Toyota                           1919
                                 ...
Mahindra                            1
Import Foreign Auto Sales Inc       1
Goldacre                            1
Aurora Cars Ltd                     1
London Taxi                         1
Name: make, Length: 133, dtype: int64

In [148]:
df['model'].value_counts()

F150 Pickup 2WD         207
Truck 2WD               187
F150 Pickup 4WD         185
Jetta                   184
Mustang                 184
                       ...
Tahoe 1500 2WD FFV        1
308                       1
Ghibli V6 SQ4 AWD         1
Wagoneer Limited 4WD      1
Mountaineer FFV 4WD       1
Name: model, Length: 3692, dtype: int64

In [156]:
df['cityCD'].dtypes

dtype('float64')

In [157]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37843 entries, 0 to 37842
Data columns (total 83 columns):
barrels08          37843 non-null float64
barrelsA08         37843 non-null float64
charge120          37843 non-null float64
charge240          37843 non-null float64
city08             37843 non-null int64
city08U            37843 non-null float64
cityA08            37843 non-null int64
cityA08U           37843 non-null float64
cityCD             37843 non-null float64
cityE              37843 non-null float64
cityUF             37843 non-null float64
co2                37843 non-null int64
co2A               37843 non-null int64
co2TailpipeAGpm    37843 non-null float64
co2TailpipeGpm     37843 non-null float64
comb08             37843 non-null int64
comb08U            37843 non-null float64
combA08            37843 non-null int64
combA08U           37843 non-null float64
combE              37843 non-null float64
combinedCD         37843 non-null float64
combinedUF         37843 non-null float64
cylinders          37720 non-null float64
displ              37723 non-null float64
drive              36654 non-null object
engId              37843 non-null int64
eng_dscr           22440 non-null object
feScore            37843 non-null int64
fuelCost08         37843 non-null int64
fuelCostA08        37843 non-null int64
fuelType           37843 non-null object
fuelType1          37843 non-null object
ghgScore           37843 non-null int64
ghgScoreA          37843 non-null int64
highway08          37843 non-null int64
highway08U         37843 non-null float64
highwayA08         37843 non-null int64
highwayA08U        37843 non-null float64
highwayCD          37843 non-null float64
highwayE           37843 non-null float64
highwayUF          37843 non-null float64
hlv                37843 non-null int64
hpv                37843 non-null int64
id                 37843 non-null int64
lv2                37843 non-null int64
lv4                37843 non-null int64
make               37843 non-null object
model              37843 non-null object
mpgData            37843 non-null object
phevBlended        37843 non-null bool
pv2                37843 non-null int64
pv4                37843 non-null int64
range              37843 non-null int64
rangeCity          37843 non-null float64
rangeCityA         37843 non-null float64
rangeHwy           37843 non-null float64
rangeHwyA          37843 non-null float64
trany              37832 non-null object
UCity              37843 non-null float64
UCityA             37843 non-null float64
UHighway           37843 non-null float64
UHighwayA          37843 non-null float64
VClass             37843 non-null object
year               37843 non-null int64
youSaveSpend       37843 non-null int64
guzzler            2281 non-null object
trans_dscr         15047 non-null object
tCharger           5186 non-null object
sCharger           666 non-null object
atvType            3072 non-null object
fuelType2          1408 non-null object
rangeA             1403 non-null object
evMotor            562 non-null object
mfrCode            7025 non-null object
c240Dscr           37 non-null object
charge240b         37843 non-null float64
c240bDscr          36 non-null object
createdOn          37843 non-null object
modifiedOn         37843 non-null object
startStop          6138 non-null object
phevCity           37843 non-null int64
phevHwy            37843 non-null int64
phevComb           37843 non-null int64
dtypes: bool(1), float64(32), int64(27), object(23)
memory usage: 23.7+ MB

In [159]:
df['guzzler'].value_counts()

G    1302
T     964
S      15
Name: guzzler, dtype: int64

In [167]:
df.drop('guzzler', axis = 1, inplace = True)#Se elimina la columna 'guzzler' especificando con axis = 1; axis =0 para filas

KeyError: "['guzzler'] not found in axis"

In [164]:
df = df.drop('phevComb', axis = 1) #Se asigna a una nueva variable el dataframe con la columna elimanada, igual que se usara inplace

In [165]:
df.columns

Index(['barrels08', 'barrelsA08', 'charge120', 'charge240', 'city08',
       'city08U', 'cityA08', 'cityA08U', 'cityCD', 'cityE', 'cityUF', 'co2',
       'co2A', 'co2TailpipeAGpm', 'co2TailpipeGpm', 'comb08', 'comb08U',
       'combA08', 'combA08U', 'combE', 'combinedCD', 'combinedUF', 'cylinders',
       'displ', 'drive', 'engId', 'eng_dscr', 'feScore', 'fuelCost08',
       'fuelCostA08', 'fuelType', 'fuelType1', 'ghgScore', 'ghgScoreA',
       'highway08', 'highway08U', 'highwayA08', 'highwayA08U', 'highwayCD',
       'highwayE', 'highwayUF', 'hlv', 'hpv', 'id', 'lv2', 'lv4', 'make',
       'model', 'mpgData', 'phevBlended', 'pv2', 'pv4', 'range', 'rangeCity',
       'rangeCityA', 'rangeHwy', 'rangeHwyA', 'trany', 'UCity', 'UCityA',
       'UHighway', 'UHighwayA', 'VClass', 'year', 'youSaveSpend', 'trans_dscr',
       'tCharger', 'sCharger', 'atvType', 'fuelType2', 'rangeA', 'evMotor',
       'mfrCode', 'c240Dscr', 'charge240b', 'c240bDscr', 'createdOn',
       'modifiedOn', 'startStop', 'phevCity', 'phevHwy'],
      dtype='object')

In [168]:
df.head(2)

,barrels08,barrelsA08,charge120,charge240,city08,city08U,cityA08,cityA08U,cityCD,cityE,...,evMotor,mfrCode,c240Dscr,charge240b,c240bDscr,createdOn,modifiedOn,startStop,phevCity,phevHwy
0,15.695714,0.0,0.0,0.0,19,0.0,0,0.0,0.0,0.0,...,NaN,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0
1,29.964545,0.0,0.0,0.0,9,0.0,0,0.0,0.0,0.0,...,NaN,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0

In [177]:
df_2 = df.copy()

In [178]:
df_2.drop(1, axis = 0,inplace = True)

In [184]:
df.reset_index(drop = True) #drop en reset_index elimina el indice que se estaba utilzando y lo reemplaza con un rango

,barrels08,barrelsA08,charge120,charge240,city08,city08U,cityA08,cityA08U,cityCD,cityE,...,evMotor,mfrCode,c240Dscr,charge240b,c240bDscr,createdOn,modifiedOn,startStop,phevCity,phevHwy
0,29.964545,0.0,0.0,0.0,9,0.0,0,0.0,0.0,0.0,...,NaN,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0
1,12.207778,0.0,0.0,0.0,23,0.0,0,0.0,0.0,0.0,...,NaN,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0
2,29.964545,0.0,0.0,0.0,10,0.0,0,0.0,0.0,0.0,...,NaN,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0
3,17.347895,0.0,0.0,0.0,17,0.0,0,0.0,0.0,0.0,...,NaN,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0
4,14.982273,0.0,0.0,0.0,21,0.0,0,0.0,0.0,0.0,...,NaN,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
37837,14.982273,0.0,0.0,0.0,19,0.0,0,0.0,0.0,0.0,...,NaN,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0
37838,14.330870,0.0,0.0,0.0,20,0.0,0,0.0,0.0,0.0,...,NaN,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0
37839,15.695714,0.0,0.0,0.0,18,0.0,0,0.0,0.0,0.0,...,NaN,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0
37840,15.695714,0.0,0.0,0.0,18,0.0,0,0.0,0.0,0.0,...,NaN,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0
37841,18.311667,0.0,0.0,0.0,16,0.0,0,0.0,0.0,0.0,...,NaN,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0

In [186]:
df.isna().sum()

barrels08         0
barrelsA08        0
charge120         0
charge240         0
city08            0
              ...
createdOn         0
modifiedOn        0
startStop     31704
phevCity          0
phevHwy           0
Length: 81, dtype: int64

In [191]:
df['startStop'].value_counts()

N    4462
Y    1676
Name: startStop, dtype: int64

In [193]:
df['startStop'].fillna('Key', inplace = True)

In [194]:
df['startStop'].value_counts()

Key    31704
N       4462
Y       1676
Name: startStop, dtype: int64

In [196]:
df_new = df[['make', 'model', 'fuelType', 'cylinders']]

In [197]:
df_new

          make                model fuelType  cylinders
1      Ferrari           Testarossa  Regular       12.0
2        Dodge              Charger  Regular        4.0
3        Dodge  B150/B250 Wagon 2WD  Regular        8.0
4       Subaru     Legacy AWD Turbo  Premium        4.0
5       Subaru               Loyale  Regular        4.0
...        ...                  ...      ...        ...
37838   Subaru               Legacy  Regular        4.0
37839   Subaru               Legacy  Regular        4.0
37840   Subaru           Legacy AWD  Regular        4.0
37841   Subaru           Legacy AWD  Regular        4.0
37842   Subaru     Legacy AWD Turbo  Premium        4.0

[37842 rows x 4 columns]

In [199]:
df_new.isna().sum()

make           0
model          0
fuelType       0
cylinders    123
dtype: int64

In [200]:
df_new.fillna(0, inplace = True)

In [201]:
df_new['fuelType'].value_counts()

Regular                        25075
Premium                        10004
Gasoline or E85                 1204
Diesel                          1101
Premium or E85                   121
Electricity                      120
Midgrade                          74
CNG                               60
Premium and Electricity           20
Gasoline or natural gas           20
Premium Gas or Electricity        17
Regular Gas and Electricity       16
Gasoline or propane                8
Regular Gas or Electricity         2
Name: fuelType, dtype: int64

In [207]:
df_new['model'].unique()

array(['Testarossa', 'Charger', 'B150/B250 Wagon 2WD', ...,
       'Ferrari 348 TB/TS', 'XJRS Convertble', 'XJRS Coupe'], dtype=object)

In [212]:
df_new

          make                model fuelType  cylinders         Traccion
1      Ferrari           Testarossa  Regular       12.0            False
2        Dodge              Charger  Regular        4.0            False
3        Dodge  B150/B250 Wagon 2WD  Regular        8.0  Traccion simple
4       Subaru     Legacy AWD Turbo  Premium        4.0            False
5       Subaru               Loyale  Regular        4.0            False
...        ...                  ...      ...        ...              ...
37838   Subaru               Legacy  Regular        4.0            False
37839   Subaru               Legacy  Regular        4.0            False
37840   Subaru           Legacy AWD  Regular        4.0            False
37841   Subaru           Legacy AWD  Regular        4.0            False
37842   Subaru     Legacy AWD Turbo  Premium        4.0            False

[37842 rows x 5 columns]

In [209]:
df_new['Traccion'] = df['model'].apply(lambda x: 'Traccion simple' if '2WD' in x else False)
#Al aplicar una funcion lambda esta, itera sobre las filas y aplica lo definido en la funcion
#Se usa apply

In [211]:
df_new['Traccion'].value_counts()

False              30761
Traccion simple     7081
Name: Traccion, dtype: int64

In [219]:
def cambio_c(x): #x representa cada una de las filas del dataframe
    return x*2

In [220]:
df_new['cylinders_2']  = df['cylinders'].apply(cambio_c) #Se pueden usar funciones completas en vez lambda de igual manera

In [218]:
df_new

,make,model,fuelType,cylinders,Traccion,cylinders_2
1,Ferrari,Testarossa,Regular,12.0,False,24.0
2,Dodge,Charger,Regular,4.0,False,8.0
3,Dodge,B150/B250 Wagon 2WD,Regular,8.0,Traccion simple,16.0
4,Subaru,Legacy AWD Turbo,Premium,4.0,False,8.0
5,Subaru,Loyale,Regular,4.0,False,8.0
...,...,...,...,...,...,...
37838,Subaru,Legacy,Regular,4.0,False,8.0
37839,Subaru,Legacy,Regular,4.0,False,8.0
37840,Subaru,Legacy AWD,Regular,4.0,False,8.0
37841,Subaru,Legacy AWD,Regular,4.0,False,8.0
37842,Subaru,Legacy AWD Turbo,Premium,4.0,False,8.0

In [280]:
df_new['trany'] = df['trany']

In [281]:
df_new['trany'].dtypes

dtype('O')

In [282]:
df_new.dtypes

make            object
model           object
fuelType        object
cylinders      float64
Traccion        object
cylinders_2    float64
trany           object
vel             object
vel_2           object
dtype: object

In [283]:
df_new['trany'] = df_new['trany'].astype('str')

In [284]:
df_new['vel'] = df_new['trany'].apply(lambda x: x.split(' ')[-1])

In [285]:
df_new

,make,model,fuelType,cylinders,Traccion,cylinders_2,trany,vel,vel_2
1,Ferrari,Testarossa,Regular,12.0,False,24.0,Manual 5-spd,5-spd,Manual
2,Dodge,Charger,Regular,4.0,False,8.0,Manual 5-spd,5-spd,Manual
3,Dodge,B150/B250 Wagon 2WD,Regular,8.0,Traccion simple,16.0,Automatic 3-spd,3-spd,Automatic
4,Subaru,Legacy AWD Turbo,Premium,4.0,False,8.0,Manual 5-spd,5-spd,Manual
5,Subaru,Loyale,Regular,4.0,False,8.0,Automatic 3-spd,3-spd,Automatic
...,...,...,...,...,...,...,...,...,...
37838,Subaru,Legacy,Regular,4.0,False,8.0,Automatic 4-spd,4-spd,Automatic
37839,Subaru,Legacy,Regular,4.0,False,8.0,Manual 5-spd,5-spd,Manual
37840,Subaru,Legacy AWD,Regular,4.0,False,8.0,Automatic 4-spd,4-spd,Automatic
37841,Subaru,Legacy AWD,Regular,4.0,False,8.0,Manual 5-spd,5-spd,Manual
37842,Subaru,Legacy AWD Turbo,Premium,4.0,False,8.0,Automatic 4-spd,4-spd,Automatic

In [274]:
df_new['vel_2'] = df_new['vel'].apply(lambda x: x[0])

In [279]:
df_new.iloc[0,-2][1]

'5-spd'

In [237]:
df_new.drop('trany', inplace = True, axis  = 1)

In [238]:
df_new

,make,model,fuelType,cylinders,Traccion,cylinders_2
1,Ferrari,Testarossa,Regular,12.0,False,24.0
2,Dodge,Charger,Regular,4.0,False,8.0
3,Dodge,B150/B250 Wagon 2WD,Regular,8.0,Traccion simple,16.0
4,Subaru,Legacy AWD Turbo,Premium,4.0,False,8.0
5,Subaru,Loyale,Regular,4.0,False,8.0
...,...,...,...,...,...,...
37838,Subaru,Legacy,Regular,4.0,False,8.0
37839,Subaru,Legacy,Regular,4.0,False,8.0
37840,Subaru,Legacy AWD,Regular,4.0,False,8.0
37841,Subaru,Legacy AWD,Regular,4.0,False,8.0
37842,Subaru,Legacy AWD Turbo,Premium,4.0,False,8.0

In [288]:
df_new['fuelType'].value_counts()

Regular                        25075
Premium                        10004
Gasoline or E85                 1204
Diesel                          1101
Premium or E85                   121
Electricity                      120
Midgrade                          74
CNG                               60
Premium and Electricity           20
Gasoline or natural gas           20
Premium Gas or Electricity        17
Regular Gas and Electricity       16
Gasoline or propane                8
Regular Gas or Electricity         2
Name: fuelType, dtype: int64

In [300]:
#Columna para tipo de auto; electrico, combustion, hibrido 
df_new['type_v'] = df['fuelType'].apply(lambda x: 'combustion' if x == 'Regular' else ('combustion' if x == 'Premium' else False))

In [303]:
df_new['type_v'].value_counts()

combustion    35079
False          2763
Name: type_v, dtype: int64

In [320]:
def comb(x):
    if x['fuelType'] == 'Regular' :
        return 'Combustion'
    elif x['fuelType'] == 'Premium':
        return 'Combustion'
    else:
        return 'Otro'

In [321]:
df_new.drop('type_v', inplace = True , axis = 1)

In [324]:
df_new['type_v'] = df_new.apply(lambda x: comb(x),axis = 1) #x funge como cada fila, y aplicamos a cada fila la funcion comb
                                                        #Dicha revisa la columna 'fuelType' y con la condicional asigna una etiqueta

In [325]:
df_new['type_v'].value_counts()

Combustion    35079
Otro           2763
Name: type_v, dtype: int64

In [329]:
def comb_2(x):
    if (x['fuelType'] == 'Regular') and (x['make'] == 'Ferrari') :
        return 'Combustion - high_cost'
    elif x['fuelType'] == 'Premium':
        return 'Combustion - low_cost'
    else:
        return 'Otro'

In [330]:
df_new['type_v_2'] = df_new.apply(lambda x: comb_2(x),axis = 1)

In [331]:
df_new

,make,model,fuelType,cylinders,Traccion,cylinders_2,trany,vel,vel_2,type_v,type_v_2
1,Ferrari,Testarossa,Regular,12.0,False,24.0,Manual 5-spd,5-spd,Manual,Combustion,Combustion - high_cost
2,Dodge,Charger,Regular,4.0,False,8.0,Manual 5-spd,5-spd,Manual,Combustion,Otro
3,Dodge,B150/B250 Wagon 2WD,Regular,8.0,Traccion simple,16.0,Automatic 3-spd,3-spd,Automatic,Combustion,Otro
4,Subaru,Legacy AWD Turbo,Premium,4.0,False,8.0,Manual 5-spd,5-spd,Manual,Combustion,Combustion - low_cost
5,Subaru,Loyale,Regular,4.0,False,8.0,Automatic 3-spd,3-spd,Automatic,Combustion,Otro
...,...,...,...,...,...,...,...,...,...,...,...
37838,Subaru,Legacy,Regular,4.0,False,8.0,Automatic 4-spd,4-spd,Automatic,Combustion,Otro
37839,Subaru,Legacy,Regular,4.0,False,8.0,Manual 5-spd,5-spd,Manual,Combustion,Otro
37840,Subaru,Legacy AWD,Regular,4.0,False,8.0,Automatic 4-spd,4-spd,Automatic,Combustion,Otro
37841,Subaru,Legacy AWD,Regular,4.0,False,8.0,Manual 5-spd,5-spd,Manual,Combustion,Otro
37842,Subaru,Legacy AWD Turbo,Premium,4.0,False,8.0,Automatic 4-spd,4-spd,Automatic,Combustion,Combustion - low_cost

In [ ]:
# metodos habituales de pandas

df.head()         # printea la cabeza, por defecto 5 filas
df.tail()         # pritea la cola, por defecto 5 filas
df.describe()     # descripcion estadistica
df.info()         # informacion del df
df.info(memory_usage='deep')
df.columns        # muestra columna
df.index          # muestra indice
df.dtypes         # muestra tipos de datos de las columnas
df.plot()         # hace un grafico
df.hist()         # hace un histograma
df.col.value_counts() # cuenta los valores unicos de una columna
df.col.unique()       # muestra valores unicos de una columna
df.copy()             # copia el df
df.drop()             # elimina columnas o filas (axis=0,1)
df.dropna()           # elimina nulos
df.fillna()           # rellena nulos
df.shape              # dimensiones del df
df._get_numeric_data()  # selecciona columnas numericas
df.rename()             # renombre columnas
df.str.replace()        # reemplaza columnas de strings
df.astype(dtype='float32')  # cambia el tipo de dato
df.iloc[]                   # localiza por indice
df.loc[]                    # localiza por elemento
df.ix[]                     # loc+iloc
df.transpose()              # transpone el df
df.T
df.sample(n, frac)          # muestra del df
df.col.sum()                # suma de una columna
df.col.max()
df.col.min()
df[col]         # selecciona columna
df.col
df.isnull()    # valores nulos
df.isna()
df.drop_duplicates() # eliminar duplicados
df.reset_index(inplace=True)  # resetea el indice y sobreescribe